#Task1
array = [621, 445, 147, 159, 430, 222, 482, 44, 194, 522, 652, 494, 14, 126, 532, 387, 441, 471, 337, 446, 18, 36, 202, 574, 556, 458, 16, 139, 222, 220, 107, 82, 264, 366, 501, 319, 314, 430, 55, 336]
p array
#1
p'Количество элементов в массиве:'
p array.length
p'____________________________________________________________________________________________'
#2
p 'Перевернутый массив:'
p array.reverse
p'____________________________________________________________________________________________'
#3
p 'Наибольшее число:' 
p array.max
p'____________________________________________________________________________________________'
#4
p 'Наименьшее число:'
p array.min
p'____________________________________________________________________________________________'
#5
p'Отсортировать от меньшего к большему:'
p array.sort
p'____________________________________________________________________________________________'
#6
p'Отсортировать от большего к меньшему:'
p array.sort.reverse
p'____________________________________________________________________________________________'
#7
p'Удалить все нечетные числа:'
p array.select {|number| number.even?}
p'____________________________________________________________________________________________'
#8
p'Числа, которые без остатка делятся на 3:'
p array.select {|number| number % 3 == 0}
p'____________________________________________________________________________________________'
#9
p"без повторов#{array.uniq}"
p'____________________________________________________________________________________________'
#10
p" Разделенный каждый элемент на 10, элементы не округлены до целого: #{array.map{ |element| element/10.0 }}"
p'____________________________________________________________________________________________'

#11
p'Новый массив, который содержыт в себе те буквы английского алфавита, порядковый номер которых есть в массиве:'
second_array=('a'..'z').to_a
new_array = Array.new()
(0..array.length-1).each do |i|
  (0..second_array.size-1).each do |y|
    if array[i]==y
      new_array << second_array[y]
    end
end
end
print new_array,"\n"
p'____________________________________________________________________________________________'


#12
p'Изменённые местами минимальный и максимальный элементы массива:'
min = array.index(array.min)
max = array.index(array.max)
array[min], array[max] = array[max], array[min]
p array
p'____________________________________________________________________________________________'

p'Элементы, которые находятся перед минимальным числом в массиве:'
(0..array.index(array.min)).each do |i|
	print "#{array[i]} "
end
print "\n"
p'____________________________________________________________________________________________'
print "\n"
#13
p'Три наименьших элемента:'
array1 = array
3.times do
	print "#{array1.min} "
	array1.delete(array1.min)
end
print "\n"
'____________________________________________________________________________________________'

